In [1]:
from sklearn.cluster import DBSCAN
from sklearn.preprocessing import StandardScaler
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
ewa=pd.read_excel("C:\\Users\\kanis\\Documents\\Assignment\\Assignments data\\Clustering\\EastWestAirlines.xlsx",sheet_name=1)

In [4]:
ewa.head()

,ID#,Balance,Qual_miles,cc1_miles,cc2_miles,cc3_miles,Bonus_miles,Bonus_trans,Flight_miles_12mo,Flight_trans_12,Days_since_enroll,Award?
0,1,28143,0,1,1,1,174,1,0,0,7000,0
1,2,19244,0,1,1,1,215,2,0,0,6968,0
2,3,41354,0,1,1,1,4123,4,0,0,7034,0
3,4,14776,0,1,1,1,500,1,0,0,6952,0
4,5,97752,0,4,1,1,43300,26,2077,4,6935,1

In [8]:
ewa.drop(['ID#','Award?'],axis=1,inplace=True)

In [10]:
stdscalar=StandardScaler().fit(ewa)
X=stdscalar.transform(ewa)

In [11]:
X

array([[-4.51140783e-01, -1.86298687e-01, -7.69578406e-01, ...,
        -3.28603258e-01, -3.62167870e-01,  1.39545434e+00],
       [-5.39456874e-01, -1.86298687e-01, -7.69578406e-01, ...,
        -3.28603258e-01, -3.62167870e-01,  1.37995704e+00],
       [-3.20031232e-01, -1.86298687e-01, -7.69578406e-01, ...,
        -3.28603258e-01, -3.62167870e-01,  1.41192021e+00],
       ...,
       [-4.29480975e-05, -1.86298687e-01,  6.83121167e-01, ...,
        -3.28603258e-01, -3.62167870e-01, -1.31560393e+00],
       [-1.85606976e-01, -1.86298687e-01, -7.69578406e-01, ...,
         2.85309024e-02, -9.85033311e-02, -1.31608822e+00],
       [-7.00507951e-01, -1.86298687e-01, -7.69578406e-01, ...,
        -3.28603258e-01, -3.62167870e-01, -1.31754109e+00]])

In [12]:
dbscan = DBSCAN(eps=0.9, min_samples=11)
dbscan.fit(X)

DBSCAN(eps=0.9, min_samples=11)

In [13]:
dbscan.labels_

array([0, 0, 0, ..., 0, 0, 0], dtype=int64)

In [14]:
pd.Series(dbscan.labels_).value_counts()

 0    3305
-1     682
 1      12
dtype: int64

In [17]:
cluster=pd.DataFrame(dbscan.labels_,columns=['clusterid'])

In [20]:
ewa1=pd.concat([ewa,cluster],axis=1)

In [22]:
ewa1.head()

,Balance,Qual_miles,cc1_miles,cc2_miles,cc3_miles,Bonus_miles,Bonus_trans,Flight_miles_12mo,Flight_trans_12,Days_since_enroll,clusterid
0,28143,0,1,1,1,174,1,0,0,7000,0
1,19244,0,1,1,1,215,2,0,0,6968,0
2,41354,0,1,1,1,4123,4,0,0,7034,0
3,14776,0,1,1,1,500,1,0,0,6952,0
4,97752,0,4,1,1,43300,26,2077,4,6935,-1

In [23]:
Result=ewa1.iloc[:,0:-1].groupby(ewa1.clusterid).mean()

In [24]:
Result

,Balance,Qual_miles,cc1_miles,cc2_miles,cc3_miles,Bonus_miles,Bonus_trans,Flight_miles_12mo,Flight_trans_12,Days_since_enroll
clusterid,,,,,,,,,,
-1,170500.152493,831.882698,2.673021,1.067449,1.071848,37532.454545,20.998534,1982.909091,5.763930,4637.585044
0,53773.521936,2.714070,1.936762,1.000000,1.000000,12968.754312,9.661725,147.479274,0.472617,4014.550983
1,27426.250000,0.000000,1.000000,2.000000,1.000000,8614.416667,11.916667,0.000000,0.000000,3266.250000